In [20]:
import os
os.getcwd()

'c:\\Users\\jaylu\\Downloads\\HGFN_Datasets\\notebooks'

In [21]:
import pandas as pd 
import sqlite3

inventory = pd.read_csv("../data/raw/HGFN_INVENTORY_MOVEMENT.csv")

inventory.head()
inventory.info()
inventory.isna().sum()
inventory.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 10 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   movement_id               120000 non-null  object
 1   sku_id                    120000 non-null  object
 2   warehouse_id              120000 non-null  object
 3   movement_type             120000 non-null  object
 4   quantity                  120000 non-null  int64
 5   timestamp                 120000 non-null  object
 6   starting_inventory_level  120000 non-null  int64
 7   ending_inventory_level    120000 non-null  int64
 8   reorder_point             120000 non-null  int64
 9   safety_stock              120000 non-null  int64
dtypes: int64(5), object(5)
memory usage: 9.2+ MB

,quantity,starting_inventory_level,ending_inventory_level,reorder_point,safety_stock
count,120000.000000,120000.000000,120000.000000,120000.000000,120000.000000
mean,134.101708,500.526475,514.707050,274.400692,124.461950
std,105.315826,198.830613,258.704664,72.289295,43.279369
min,-100.000000,0.000000,0.000000,150.000000,50.000000
25%,56.000000,365.000000,330.000000,212.000000,87.000000
50%,120.000000,500.500000,503.000000,274.000000,124.000000
75%,191.000000,636.000000,687.000000,337.000000,162.000000
max,399.000000,1427.000000,1656.000000,399.000000,199.000000

In [22]:
conn = sqlite3.connect("../data/processed/HGFN.db")
inventory.to_sql("inventory", conn, if_exists="replace", index=False)

120000

In [23]:
orders = pd.read_csv("../data/raw/HGFN_ORDERS.csv")

orders.head()
orders.info()
orders.isna().sum()
orders.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80000 entries, 0 to 79999
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   order_id                80000 non-null  object
 1   sku_id                  80000 non-null  object
 2   warehouse_id            80000 non-null  object
 3   quantity                80000 non-null  int64
 4   order_timestamp         80000 non-null  object
 5   fulfillment_timestamp   80000 non-null  object
 6   fulfillment_time_hours  80000 non-null  float64
 7   region                  80000 non-null  object
 8   shipping_method         80000 non-null  object
 9   delivery_time_days      80000 non-null  int64
dtypes: float64(1), int64(2), object(7)
memory usage: 6.1+ MB

           quantity  fulfillment_time_hours  delivery_time_days
count  80000.000000            80000.000000        80000.000000
mean       3.648363               29.570509            2.962325
std        4.286980               14.681144            1.335450
min        1.000000                1.000000            1.000000
25%        1.000000               18.120000            2.000000
50%        2.000000               29.800000            3.000000
75%        4.000000               40.380000            4.000000
max       20.000000               84.410000            9.000000

In [24]:
conn = sqlite3.connect("../data/processed/HGFN.db")
orders.to_sql("orders", conn, if_exists="replace", index=False)

80000

In [25]:
sku_master = pd.read_csv("../data/raw/HGFN_SKU_MASTER.csv")

sku_master.head()
sku_master.info()
sku_master.isna().sum()
sku_master.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sku_id        10000 non-null  object
 1   sku_name      10000 non-null  object
 2   category      10000 non-null  object
 3   sub_category  10000 non-null  object
 4   cost          10000 non-null  float64
 5   price         10000 non-null  float64
 6   supplier_id   10000 non-null  object
 7   weight        10000 non-null  float64
dtypes: float64(3), object(5)
memory usage: 625.1+ KB

               cost         price        weight
count  10000.000000  10000.000000  10000.000000
mean     101.313232    187.384001     24.929350
std       56.861812    113.659969     14.365208
min        2.010000      2.640000      0.100000
25%       52.230000     91.937500     12.550000
50%      101.575000    180.535000     24.980000
75%      150.682500    269.147500     37.085000
max      199.990000    498.980000     49.980000

In [26]:
conn = sqlite3.connect("../data/processed/HGFN.db")
sku_master.to_sql("sku_master", conn, if_exists="replace", index=False)

10000

In [27]:
suppliers = pd.read_csv("../data/raw/HGFN_SUPPLIER_PERFORMANCE.csv")

suppliers.head()
suppliers.info()
suppliers.isna().sum()
suppliers.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   supplier_id         30000 non-null  object
 1   shipment_id         30000 non-null  object
 2   order_date          30000 non-null  object
 3   promised_lead_time  30000 non-null  int64
 4   actual_lead_time    30000 non-null  int64
 5   units_ordered       30000 non-null  int64
 6   units_received      30000 non-null  int64
 7   delivery_status     30000 non-null  object
 8   cost_per_unit       30000 non-null  float64
dtypes: float64(1), int64(4), object(4)
memory usage: 2.1+ MB

,promised_lead_time,actual_lead_time,units_ordered,units_received,cost_per_unit
count,30000.000000,30000.000000,30000.000000,30000.000000,30000.000000
mean,11.474967,11.029667,274.586800,269.840333,100.598787
std,5.179698,5.853147,129.231454,128.173155,57.338567
min,3.000000,1.000000,50.000000,36.000000,2.000000
25%,7.000000,6.000000,163.000000,160.000000,50.577500
50%,11.000000,11.000000,274.000000,268.000000,100.435000
75%,16.000000,16.000000,387.000000,379.000000,150.520000
max,20.000000,30.000000,499.000000,499.000000,199.990000

In [28]:
conn = sqlite3.connect("../data/processed/HGFN.db")
suppliers.to_sql("suppliers", conn, if_exists="replace", index=False)

30000

In [29]:
warehouse = pd.read_csv("../data/raw/HGFN_WAREHOUSE_DAILY.csv")

warehouse.head()
warehouse.info()
warehouse.isna().sum()
warehouse.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5480 entries, 0 to 5479
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   warehouse_id      5480 non-null   object
 1   date              5480 non-null   object
 2   picks_per_hour    5480 non-null   float64
 3   lines_per_hour    5480 non-null   float64
 4   receiving_volume  5480 non-null   int64
 5   outbound_volume   5480 non-null   int64
 6   labor_hours       5480 non-null   float64
 7   errors            5480 non-null   int64
 8   rework            5480 non-null   int64
dtypes: float64(3), int64(4), object(2)
memory usage: 385.4+ KB

,picks_per_hour,lines_per_hour,receiving_volume,outbound_volume,labor_hours,errors,rework
count,5480.000000,5480.000000,5480.000000,5480.000000,5480.000000,5480.000000,5480.000000
mean,80.066131,80.170703,878.462956,986.885219,538.738208,3.028102,1.187956
std,14.829049,17.620796,253.960732,283.152960,111.167589,1.753138,1.107673
min,25.840000,28.340000,72.000000,201.000000,136.480000,0.000000,0.000000
25%,69.640000,67.727500,707.750000,794.000000,463.755000,2.000000,0.000000
50%,80.005000,79.195000,859.000000,965.500000,536.240000,3.000000,1.000000
75%,90.130000,91.562500,1029.000000,1154.250000,611.485000,4.000000,2.000000
max,141.140000,155.510000,2464.000000,2206.000000,946.620000,11.000000,7.000000

In [30]:
conn = sqlite3.connect("../data/processed/HGFN.db")
warehouse.to_sql("warehouse", conn, if_exists="replace", index=False)

5480

In [31]:
conn.execute("DROP VIEW IF EXISTS orders_clean;")
conn.execute("DROP VIEW IF EXISTS supplier_clean;")
conn.execute("DROP VIEW IF EXISTS inventory_clean;")
conn.execute("DROP VIEW IF EXISTS warehouse_clean;")

In [32]:
orders_clean_sql = """
CREATE VIEW IF NOT EXISTS orders_clean AS
SELECT
    order_id,
    sku_id,
    warehouse_id,
    CAST(order_timestamp AS DATE) AS order_date,
    CAST(fulfillment_timestamp AS DATE) AS fulfillment_date,
    region,
    shipping_method,
    quantity,
    fulfillment_time_hours,
    delivery_time_days,
    -- NEW column: time from order to fulfillment
    (JULIANDAY(fulfillment_timestamp) - JULIANDAY(order_timestamp)) AS days_to_fulfill
FROM orders;
"""
conn.execute(orders_clean_sql)

pd.read_sql("SELECT * FROM orders_clean LIMIT 5", conn)

,order_id,sku_id,warehouse_id,order_date,fulfillment_date,region,shipping_method,quantity,fulfillment_time_hours,delivery_time_days,days_to_fulfill
0,ORD0000001,SKU05505,MFC,2024,2024,Midwest,Standard,3,45.72,6,1.905032
1,ORD0000002,SKU02542,CFC,2024,2024,Central,Standard,3,41.35,5,1.722992
2,ORD0000003,SKU05924,CFC,2023,2023,Central,Standard,2,52.81,4,2.200275
3,ORD0000004,SKU05295,MFC,2024,2024,Midwest,Standard,1,33.88,5,1.411482
4,ORD0000005,SKU00424,SFC,2024,2024,South,Standard,1,25.71,1,1.071309

In [33]:
supplier_clean_sql = """
CREATE VIEW supplier_clean AS
SELECT
    supplier_id,
    shipment_id,
    CAST(order_date AS DATE)        AS order_date,
    promised_lead_time,
    actual_lead_time,
    units_ordered,
    units_received,
    delivery_status,
    cost_per_unit,
    -- NEW: safe fill rate
    CASE 
        WHEN units_ordered = 0 THEN NULL
        ELSE units_received * 1.0 / units_ordered
    END AS fill_rate,
    -- NEW: lead time variance (actual - promised)
    actual_lead_time - promised_lead_time AS lead_variance
FROM suppliers;
"""
conn.execute(supplier_clean_sql)

pd.read_sql("SELECT * FROM supplier_clean LIMIT 5;", conn)

,supplier_id,shipment_id,order_date,promised_lead_time,actual_lead_time,units_ordered,units_received,delivery_status,cost_per_unit,fill_rate,lead_variance
0,SUP011,SHP000001,2022,8,12,69,69,Late,68.30,1.0,4
1,SUP026,SHP000002,2022,20,23,330,330,Late,179.33,1.0,3
2,SUP038,SHP000003,2023,20,23,464,464,Late,135.43,1.0,3
3,SUP019,SHP000004,2023,11,9,394,394,Early,88.34,1.0,-2
4,SUP011,SHP000005,2023,19,22,476,476,Late,163.90,1.0,3

In [34]:
inventory_clean_sql = """
CREATE VIEW inventory_clean AS
SELECT
    movement_id,
    sku_id,
    warehouse_id,
    movement_type,
    quantity,
    CAST(timestamp AS DATE)         AS movement_date,
    starting_inventory_level,
    ending_inventory_level,
    reorder_point,
    safety_stock,
    -- NEW: change in inventory level
    ending_inventory_level - starting_inventory_level AS inventory_change
FROM inventory;
"""
conn.execute(inventory_clean_sql)

pd.read_sql("SELECT * FROM inventory_clean LIMIT 5;", conn)

,movement_id,sku_id,warehouse_id,movement_type,quantity,movement_date,starting_inventory_level,ending_inventory_level,reorder_point,safety_stock,inventory_change
0,MOV0000001,SKU09198,WFC,Inbound,291,2024,659,950,154,124,291
1,MOV0000002,SKU00634,SFC,Outbound,49,2022,59,10,332,100,-49
2,MOV0000003,SKU03516,CFC,Outbound,133,2022,309,176,337,185,-133
3,MOV0000004,SKU00385,WFC,Outbound,19,2023,895,876,292,102,-19
4,MOV0000005,SKU04952,CFC,Outbound,119,2023,547,428,182,72,-119

In [35]:
sku_clean_sql = """
CREATE VIEW IF NOT EXISTS sku_clean AS
SELECT
    sku_id,
    sku_name,
    category,
    sub_category,
    cost,
    price,
    supplier_id,
    weight,
    price - cost AS profit_per_unit,
    CASE 
        WHEN cost = 0 THEN NULL
        ELSE (price - cost) * 1.0 / cost
    END AS margin_pct
FROM sku_master;
"""
conn.execute(sku_clean_sql)
pd.read_sql("SELECT * FROM sku_clean LIMIT 5", conn)

,sku_id,sku_name,category,sub_category,cost,price,supplier_id,weight,profit_per_unit,margin_pct
0,SKU00001,Product SKU00001,Home & Kitchen,Appliances,76.16,185.52,SUP048,36.63,109.36,1.435924
1,SKU00002,Product SKU00002,Health & Beauty,Skincare,120.53,169.08,SUP015,7.88,48.55,0.402804
2,SKU00003,Product SKU00003,Apparel,Kids,13.50,31.40,SUP007,30.10,17.90,1.325926
3,SKU00004,Product SKU00004,Grocery,Dry Goods,142.20,174.45,SUP038,48.50,32.25,0.226793
4,SKU00005,Product SKU00005,Automotive,Parts,166.82,246.23,SUP002,9.17,79.41,0.476022

In [36]:
warehouse_clean_sql = """
CREATE VIEW warehouse_clean AS
SELECT
    warehouse_id,
    CAST(date AS DATE) AS work_date,
    picks_per_hour,
    lines_per_hour,
    receiving_volume,
    outbound_volume,
    labor_hours,
    errors,
    rework,
    -- NEW: productivity (guard against zero hours)
    CASE 
        WHEN labor_hours = 0 THEN NULL
        ELSE outbound_volume * 1.0 / labor_hours
    END AS units_per_labor_hour,
    -- NEW: error rate (guard against zero outbound volume)
    CASE 
        WHEN outbound_volume = 0 THEN NULL
        ELSE errors * 1.0 / outbound_volume
    END AS error_rate
FROM warehouse;
"""
conn.execute(warehouse_clean_sql)

pd.read_sql("SELECT * FROM warehouse_clean LIMIT 5;", conn)

,warehouse_id,work_date,picks_per_hour,lines_per_hour,receiving_volume,outbound_volume,labor_hours,errors,rework,units_per_labor_hour,error_rate
0,EFC,2022,83.08,66.78,865,459,518.37,1,0,0.885468,0.002179
1,EFC,2022,77.85,63.95,674,843,571.57,4,2,1.474885,0.004745
2,EFC,2022,103.24,92.07,574,987,418.25,2,0,2.359833,0.002026
3,EFC,2022,67.96,64.23,1029,952,722.69,0,0,1.317301,0.000000
4,EFC,2022,52.57,51.67,836,1012,406.15,2,1,2.491690,0.001976

In [37]:
pd.read_sql("""
    SELECT name, type 
    FROM sqlite_master 
    WHERE type IN ('table', 'view')
    ORDER BY type, name;
""", conn)

              name   type
0        inventory  table
1           orders  table
2       sku_master  table
3        suppliers  table
4        warehouse  table
5  inventory_clean   view
6     orders_clean   view
7        sku_clean   view
8   supplier_clean   view
9  warehouse_clean   view

In [38]:
pd.read_sql("SELECT * FROM orders_clean", conn).to_csv("../data/processed/orders_clean.csv", index=False)
pd.read_sql("SELECT * FROM supplier_clean", conn).to_csv("../data/processed/supplier_clean.csv", index=False)
pd.read_sql("SELECT * FROM inventory_clean", conn).to_csv("../data/processed/inventory_clean.csv", index=False)
pd.read_sql("SELECT * FROM warehouse_clean", conn).to_csv("../data/processed/warehouse_clean.csv", index=False)
pd.read_sql("SELECT * FROM sku_clean", conn).to_csv("../data/processed/sku_clean.csv", index=False)